<!-- Merge,Join & Concatenate:
 -->

In [2]:
import pandas as pd

In [3]:
data1={"Emp Name" :["tariq","Saad","Ahmed"],"Age":[25,45,28]}
data2={"Emp Name" :["tariq","Saad","Ahmed"],"Emp Id":["E01","E08","E09"]}
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
print(df1)

print()

print(df2)

  Emp Name  Age
0    tariq   25
1     Saad   45
2    Ahmed   28

  Emp Name Emp Id
0    tariq    E01
1     Saad    E08
2    Ahmed    E09

In [4]:
print(pd.merge(df1,df2,on="Emp Name",how ="right" ))

  Emp Name  Age Emp Id
0    tariq   25    E01
1     Saad   45    E08
2    Ahmed   28    E09

In [9]:
print(pd.merge(df1,df2,on="Emp Name",how="left" ))

  Emp Name  Age Emp Id
0    tariq   25    E01
1     Saad   45    E08
2    Ahmed   28    E09

In [19]:
data={"Fruits":["Apple","Orange","Papaya","Banana"],"Price":[25,122,160,150],"Quantity":[15,10,5,16]}
df1=pd.DataFrame(data)
df1

   Fruits  Price  Quantity
0   Apple     25        15
1  Orange    122        10
2  Papaya    160         5
3  Banana    150        16

In [35]:
df2=df1.copy()
df2

   Fruits  Price  Quantity
0   Apple     25        15
1  Orange    122        10
2  Papaya    160         5
3  Banana    150        16

In [37]:
df2.loc[0,"Price"]=30
df2.loc[1,"Price"]=150
df2.loc[2,"Price"]=165
df2.loc[3,"Price"]=155
df2

   Fruits  Price  Quantity
0   Apple     30        15
1  Orange    150        10
2  Papaya    165         5
3  Banana    155        16

In [39]:
df1.compare(df2)

  Price
   self other
0    25    30
1   122   150
2   160   165
3   150   155

In [43]:
(df1.compare(df2,keep_equal=True))

  Price
   self other
0    25    30
1   122   150
2   160   165
3   150   155

In [49]:
(df1.compare(df2,keep_shape=True))

  Fruits       Price       Quantity
    self other  self other     self other
0    NaN   NaN    25    30      NaN   NaN
1    NaN   NaN   122   150      NaN   NaN
2    NaN   NaN   160   165      NaN   NaN
3    NaN   NaN   150   155      NaN   NaN

In [51]:
(df1.compare(df2,keep_shape=False))

  Price
   self other
0    25    30
1   122   150
2   160   165
3   150   155